Autodesk.Navisworks.Api.ProgressVisibilityEventArgs
Event arguments used for the Application::ProgressVisibility event

Autodesk.Navisworks.Api.ProgressVisibilityEventArgs.Progress
Gets a reference to the Progress class instance relating to this Event.

Autodesk.Navisworks.Api.ProgressVisibilityEventArgs.WantVisible
Gets a value indicating whether the progress dialog should be visible or not